sdaiValidateAggrSizes(Sdai_instS*,Sdai_Id_aggr*)
\details
Validates whether the aggregate size constraints defined in the data dictionary for the specified application instance are satisfied.
Retrieves the non-persistent list of attributes with unsatisfied size constraints, if found.
\param instance [in]  Identifier of the application instance to be validated.
\param list     [out] The identifier of a pre-existing NPL to which the SdaiAttr identifiers of
those attributes are appended that do not conform to the validation.
\returns
* sdaiTRUE if attributes with unsatisfied size constraints are not found.
* sdaiFALSE if such attributes are found.
* sdaiUNKNOWN if an error is encountered.